Overload List
Name  |   Description
CreateExtrusionGeometry(IList CurveLoop , XYZ, Double)
 Creates a solid by linearly extruding one or more closed coplanar curve loops.
CreateExtrusionGeometry(IList CurveLoop , XYZ, Double, SolidOptions)
 Creates a solid by linearly extruding one or more closed coplanar curve loops.
 See Also
  GeometryCreationUtilities Class
  GeometryCreationUtilities Members
  Autodesk.Revit.DB Namespace